---
kind: type
id: T:Autodesk.Revit.DB.ElementWorksetFilter
source: html/9fef9119-9ab1-b63a-15a3-804d08228d7e.htm
---
# Autodesk.Revit.DB.ElementWorksetFilter

A filter used to match elements which reside in a given workset.

## Syntax (C#)
```csharp
public class ElementWorksetFilter : ElementQuickFilter
```

## Remarks
This filter is a quick filter.